[
    {
        "complaint": "My Dell Inspiron screen flickers intermittently, and it's a 15.6-inch display."
    },
    {
        "complaint": "The battery life on my Lenovo ThinkPad with an Intel Core i7 is terrible, lasting only 2 hours."
    },
    {
        "complaint": "My HP Pavilion with an AMD Ryzen 5 processor is overheating after just 30 minutes of use."
    },
    {
        "complaint": "The touchpad on my MacBook Air with an M1 chip is unresponsive."
    },
    {
        "complaint": "I am experiencing random shutdowns on my Acer Aspire with an AMD Ryzen 7 processor."
    },
    {
        "complaint": "The keyboard on my Asus ROG laptop has stopped working."
    },
    {
        "complaint": "My MSI laptop's fan is making a loud noise."
    },
    {
        "complaint": "The Wi-Fi connection on my Toshiba Satellite with an Intel Core i5 keeps dropping."
    },
    {
        "complaint": "My Alienware laptop with an Intel Core i9 is having graphics card issues with the NVIDIA GeForce RTX 3080."
    },
    {
        "complaint": "The speakers on my Samsung Galaxy Book are very low in volume."
    },
    {
        "complaint": "I can't seem to get my Huawei MateBook with an Intel Core i5 to charge properly."
    },
    {
        "complaint": "The USB ports on my Sony VAIO are not working."
    },
    {
        "complaint": "My Gigabyte laptop's 17-inch screen has dead pixels."
    },
    {
        "complaint": "I am having issues with the 1080p webcam on my Razer Blade with an Intel Core i7."
    },
    {
        "complaint": "The Ethernet port on my Fujitsu Lifebook is malfunctioning."
    },
    {
        "complaint": "My Panasonic Toughbook has a broken hinge."
    },
    {
        "complaint": "The backlight on my LG Gram keyboard is flickering."
    },
    {
        "complaint": "The audio jack on my Microsoft Surface Pro 7 is not detecting headphones."
    },
    {
        "complaint": "My Vaio laptop’s trackpad is stuck."
    },
    {
        "complaint": "The BIOS on my Clevo laptop is corrupted."
    },
    {
        "complaint": "The fingerprint sensor on my Xiaomi Mi Notebook with an Intel Core i5 is unresponsive."
    },
    {
        "complaint": "My Chuwi laptop’s screen is not turning on."
    },
    {
        "complaint": "The DVD drive on my Gateway laptop is not reading discs."
    },
    {
        "complaint": "My Dynabook laptop's SSD is failing."
    },
    {
        "complaint": "The Bluetooth on my Medion Akoya laptop is not connecting."
    },
    {
        "complaint": "My Bmax laptop with an AMD Ryzen 5 is running very slow."
    },
    {
        "complaint": "The hinge on my JUMPER EZbook is loose."
    },
    {
        "complaint": "My Voyo laptop’s battery is draining too quickly."
    },
    {
        "complaint": "The fan on my iLife Zed laptop is making a grinding noise."
    },
    {
        "complaint": "My Teclast laptop's keyboard is missing keys."
    },
    {
        "complaint": "The display on my Onda laptop is flickering, and it's a 14-inch IPS display."
    },
    {
        "complaint": "My Fusion5 laptop's battery swelled up."
    },
    {
        "complaint": "The webcam on my Smartbook laptop is not working."
    },
    {
        "complaint": "My NuVision laptop is not booting up."
    },
    {
        "complaint": "The screen on my Nextbook laptop is cracked."
    },
    {
        "complaint": "My Cube iWork laptop's touch screen is unresponsive."
    },
    {
        "complaint": "The touchpad on my Azpen laptop is not clicking."
    },
    {
        "complaint": "My Ematic laptop’s battery life is very short, lasting only 1 hour."
    },
    {
        "complaint": "The charger on my RCA Cambio is overheating."
    },
    {
        "complaint": "My Brydge laptop’s screen brightness is too low."
    },
    {
        "complaint": "The speakers on my Venturer laptop are crackling."
    },
    {
        "complaint": "My Avita Liber laptop’s 13.3-inch screen resolution is poor."
    },
    {
        "complaint": "The Wi-Fi on my Pinebook Pro is not working."
    },
    {
        "complaint": "My Eve V laptop’s keyboard is not connecting."
    },
    {
        "complaint": "The USB-C port on my Alldocube laptop is loose."
    },
    {
        "complaint": "My T-bao laptop's hinge is broken."
    },
    {
        "complaint": "The backlight on my I-Life Zed Air Pro is flickering."
    },
    {
        "complaint": "My Micromax Canvas laptop's touchpad is too sensitive."
    },
    {
        "complaint": "The battery on my InFocus Kangaroo Notebook is not charging."
    },
    {
        "complaint": "My Datawind laptop’s screen has vertical lines."
    }
]